#### Matrix Multiplicaton
- x+2y+3z=6
- 2x+3y+z=6
- x+y+5z=7

- |1 2 3| |x| |6|
- |2 3 1|*|y|=|6|
- |1 1 5| |z| |7|

x=A'B
x=ginv(A)%*%B

In [2]:
library(MASS)

In [15]:
A<-matrix(c(1,2,1,2,3,1,3,1,5),3,3) #filled columnwise
A
B<-c(6,6,7)
B
ginv(A)%*%A
x<-ginv(A)%*%B
x

     [,1] [,2] [,3]
[1,] 1    2    3
[2,] 2    3    1
[3,] 1    1    5

[1] 6 6 7

     [,1]         [,2]          [,3]
[1,] 1.000000e+00 -8.881784e-16  1.776357e-15
[2,] 7.771561e-16  1.000000e+00 -1.332268e-15
[3,] 2.498002e-16  3.053113e-16  1.000000e+00

     [,1]
[1,] 1
[2,] 1
[3,] 1

#### Arrarys with moe than two diamention

In [8]:
v4<-1:27
v4

 [1]  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25
[26] 26 27

In [9]:
dim(v4)<-c(3,3,3)
v4

, , 1

     [,1] [,2] [,3]
[1,]    1    4    7
[2,]    2    5    8
[3,]    3    6    9

, , 2

     [,1] [,2] [,3]
[1,]   10   13   16
[2,]   11   14   17
[3,]   12   15   18

, , 3

     [,1] [,2] [,3]
[1,]   19   22   25
[2,]   20   23   26
[3,]   21   24   27

In [10]:
v4[1,1,1]

[1] 1

In [11]:
v4[,1,1]

[1] 1 2 3

In [12]:
v4[,,1]

     [,1] [,2] [,3]
[1,] 1    4    7
[2,] 2    5    8
[3,] 3    6    9

In [13]:
v4[,,2]

     [,1] [,2] [,3]
[1,] 10   13   16
[2,] 11   14   17
[3,] 12   15   18

In [14]:
v4[,2,]

     [,1] [,2] [,3]
[1,] 4    13   22
[2,] 5    14   23
[3,] 6    15   24

In [40]:
v5<-1:6
d1<-c(2,2,2)
A1<-array(v5,d1)
A1

, , 1

     [,1] [,2]
[1,]    1    3
[2,]    2    4

, , 2

     [,1] [,2]
[1,]    5    1
[2,]    6    2

In [41]:
v6<-1
d1
A2<-array(v6,d1)
A2

[1] 2 2 2

, , 1

     [,1] [,2]
[1,]    1    1
[2,]    1    1

, , 2

     [,1] [,2]
[1,]    1    1
[2,]    1    1

In [ ]:
?array

#### List - a row in a table - two operators $ and [[]]

In [19]:
lst <- list(name="Fred", wife="Mary", no.children=3, child.ages=c(4,7,9))
lst

# retrieving components in a list
# using $ operator
lst$name
lst$wife
lst$no.children
lst$child.ages[2]

#using [[]] operator
lst[[1]]
lst[[2]]
lst[[3]]
lst[[4]]
lst[[4]][[2]]

$name
[1] "Fred"

$wife
[1] "Mary"

$no.children
[1] 3

$child.ages
[1] 4 7 9

[1] "Fred"

[1] "Mary"

[1] 3

[1] 7

[1] "Fred"

[1] "Mary"

[1] 3

[1] 4 7 9

[1] 7

In [20]:
eye.colours <- factor(c("R","B","L","B","R","L","G","L"))
levels(eye.colours)
eye.colours
table(eye.colours)

[1] "B" "G" "L" "R"

[1] R B L B R L G L
Levels: B G L R

eye.colours
B G L R
2 1 3 2

In [21]:
survey.result <- factor(c("SD","AG","SD","SA","DI","NE","SA","DI","AG"),levels = c("SD","DI","NE","AG","SA"),ordered = TRUE)
survey.result

[1] SD AG SD SA DI NE SA DI AG
Levels: SD < DI < NE < AG < SA

In [22]:
#internally stored in numeric format
mode(survey.result)

[1] "numeric"

In [24]:
#structure of the "survey.result"
str(survey.result)

 Ord.factor w/ 5 levels "SD"<"DI"<"NE"<..: 1 4 1 5 2 3 5 2 4

In [26]:
#Passive Survey: Gender of students coming out of library
gender<-factor(c("F","M","F","M","F","M","F","M"),levels=c("M","F"), ordered=FALSE)
gender

[1] F M F M F M F M
Levels: M F

In [27]:
class(survey.result)

[1] "ordered" "factor"

In [28]:
survey.result.unclass<-unclass(survey.result)
survey.result.unclass

[1] 1 4 1 5 2 3 5 2 4
attr(,"levels")
[1] "SD" "DI" "NE" "AG" "SA"

In [29]:
class(survey.result.unclass)

[1] "integer"

In [33]:
class(survey.result.unclass)<-c("factor","ordered")
class(survey.result.unclass)
str(survey.result.unclass)

[1] "factor"  "ordered"

 Ord.factor w/ 5 levels "SD"<"DI"<"NE"<..: 1 4 1 5 2 3 5 2 4

#### Data Frames

In [34]:
student <- data.frame(roll.no=c(1:4),student.name=c("A","B","C","D"))
student

  roll.no student.name
1 1       A
2 2       B
3 3       C
4 4       D

In [36]:
nrow(student)

[1] 4

In [37]:
ncol(student)

[1] 2

In [38]:
row.names(student)<-c("First","Second","Third","Fourth")
student

       roll.no student.name
First  1       A
Second 2       B
Third  3       C
Fourth 4       D

#### Managing data in R

In [42]:
getwd()

[1] "C:/Users/Nilkanth Jadhav/ETLHIVE Notebooks/R/Day 3"

In [43]:
setwd('C:/Users/Nilkanth Jadhav/ETLHIVE Notebooks/R/Day 3/data')

In [44]:
dir()

[1] "EMP.csv"                   "example.R"
[3] "F-statistic.xlsx"          "Fundamentals of R 1.0.pdf"
[5] "numb_in_file.txt"          "R-Course -pdf 1.0.pdf"
[7] "R Data Structure 1.1.pdf"  "sourceExample.R"

In [45]:
numb.in.file<-scan("numb_in_file.txt")
numb.in.file

 [1]  1  3  5  7  9 11 13 15 17 19 21 23 25 27 29 31 33 35 37 39 41 43

In [47]:
mode(numb.in.file)

[1] "numeric"

In [48]:
numb.in.file<-scan("numb_in_file.txt", what = "character", nmax = 5)
numb.in.file

[1] "1" "3" "5" "7" "9"

In [50]:
numb.in.file<-scan("numb_in_file.txt", what = "character", nmax = 5, sep=" ", skip = 1)
numb.in.file

[1] "23" "25" "27" "29" "31"

In [57]:
numb.in.file<-scan("numb_in_file.txt", what = "character", nmax = 15, sep=" ", skip = 1, nlines = 2)
#skip - will skip the lines from start
#nlines - will go on reading for that much of lines
numb.in.file

 [1] "23" "25" "27" "29" "31" "33" "35" "37" "39" "41" "43" "34" "33" "38" "34"

In [59]:
#Import file using data.table
empdata<-read.table("EMP.csv", sep=",")
head(empdata)

  V1          V2         V3        V4       V5           V6        V7
1 EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
2 100         Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES
3 101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
4 102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
5 103         Alexander  Hunold    AHUNOLD  590.423.4567 03-JAN-90 IT_PROG
6 104         Bruce      Ernst     BERNST   590.423.4568 21-MAY-91 IT_PROG
  V8     V9         V10
1 SALARY MANAGER_ID DEPARTMENT_ID
2 24000             90
3 17000  100        90
4 17000  100        90
5 9000   102        60
6 6000   103        60

In [60]:
empdata<-read.table("EMP.csv", header = TRUE, sep=",")
head(empdata)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 100         Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
3 102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
4 103         Alexander  Hunold    AHUNOLD  590.423.4567 03-JAN-90 IT_PROG
5 104         Bruce      Ernst     BERNST   590.423.4568 21-MAY-91 IT_PROG
6 105         David      Austin    DAUSTIN  590.423.4569 25-JUN-97 IT_PROG
  SALARY MANAGER_ID DEPARTMENT_ID
1 24000   NA        90
2 17000  100        90
3 17000  100        90
4  9000  102        60
5  6000  103        60
6  4800  103        60

In [62]:
empdata<-read.table("EMP.csv", header = TRUE, sep=",", nrows = 10)
empdata

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1  100         Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES
2  101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
3  102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
4  103         Alexander  Hunold    AHUNOLD  590.423.4567 03-JAN-90 IT_PROG
5  104         Bruce      Ernst     BERNST   590.423.4568 21-MAY-91 IT_PROG
6  105         David      Austin    DAUSTIN  590.423.4569 25-JUN-97 IT_PROG
7  106         Valli      Pataballa VPATABAL 590.423.4560 05-FEB-98 IT_PROG
8  107         Diana      Lorentz   DLORENTZ 590.423.5567 07-FEB-99 IT_PROG
9  108         Nancy      Greenberg NGREENBE 515.124.4569 17-AUG-94 FI_MGR
10 109         Daniel     Faviet    DFAVIET  515.124.4169 16-AUG-94 FI_ACCOUNT
   SALARY MANAGER_ID DEPARTMENT_ID
1  24000   NA         90
2  17000  100         90
3  17000  100         90
4   9000  102         60
5   6000  103         60
6   4800  103         60
7   4800  103         60
8   4200  103         60
9  12000  101        100
10  9000  108        100

In [64]:
empdata<-read.table("EMP.csv", header = FALSE, sep=",", nrows = 10, skip=5)
empdata

   V1  V2          V3        V4       V5           V6        V7         V8
1  104 Bruce       Ernst     BERNST   590.423.4568 21-MAY-91 IT_PROG     6000
2  105 David       Austin    DAUSTIN  590.423.4569 25-JUN-97 IT_PROG     4800
3  106 Valli       Pataballa VPATABAL 590.423.4560 05-FEB-98 IT_PROG     4800
4  107 Diana       Lorentz   DLORENTZ 590.423.5567 07-FEB-99 IT_PROG     4200
5  108 Nancy       Greenberg NGREENBE 515.124.4569 17-AUG-94 FI_MGR     12000
6  109 Daniel      Faviet    DFAVIET  515.124.4169 16-AUG-94 FI_ACCOUNT  9000
7  110 John        Chen      JCHEN    515.124.4269 28-SEP-97 FI_ACCOUNT  8200
8  111 Ismael      Sciarra   ISCIARRA 515.124.4369 30-SEP-97 FI_ACCOUNT  7700
9  112 Jose Manuel Urman     JMURMAN  515.124.4469 07-MAR-98 FI_ACCOUNT  7800
10 113 Luis        Popp      LPOPP    515.124.4567 07-DEC-99 FI_ACCOUNT  6900
   V9  V10
1  103  60
2  103  60
3  103  60
4  103  60
5  101 100
6  108 100
7  108 100
8  108 100
9  108 100
10 108 100

In [65]:
empdata<-read.table("EMP.csv", header = FALSE, sep=",", nrows = 1)
empdata

  V1          V2         V3        V4    V5           V6        V7     V8
1 EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL PHONE_NUMBER HIRE_DATE JOB_ID SALARY
  V9         V10
1 MANAGER_ID DEPARTMENT_ID

#### Import files using data.csv

In [71]:
empdata<-read.csv("EMP.csv")
head(empdata)
tail(empdata)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 100         Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
3 102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
4 103         Alexander  Hunold    AHUNOLD  590.423.4567 03-JAN-90 IT_PROG
5 104         Bruce      Ernst     BERNST   590.423.4568 21-MAY-91 IT_PROG
6 105         David      Austin    DAUSTIN  590.423.4569 25-JUN-97 IT_PROG
  SALARY MANAGER_ID DEPARTMENT_ID
1 24000   NA        90
2 17000  100        90
3 17000  100        90
4  9000  102        60
5  6000  103        60
6  4800  103        60

    EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
102 201         Michael    Hartstein MHARTSTE 515.123.5555 17-FEB-96 MK_MAN
103 202         Pat        Fay       PFAY     603.123.6666 17-AUG-97 MK_REP
104 203         Susan      Mavris    SMAVRIS  515.123.7777 07-JUN-94 HR_REP
105 204         Hermann    Baer      HBAER    515.123.8888 07-JUN-94 PR_REP
106 205         Shelley    Higgins   SHIGGINS 515.123.8080 07-JUN-94 AC_MGR
107 206         William    Gietz     WGIETZ   515.123.8181 07-JUN-94 AC_ACCOUNT
    SALARY MANAGER_ID DEPARTMENT_ID
102 13000  100         20
103  6000  201         20
104  6500  101         40
105 10000  101         70
106 12000  101        110
107  8300  205        110

#### dplyr

In [73]:
library(dplyr)

In [75]:
# Exploring structure of data
str(empdata)
names(empdata)
head(empdata,3)

'data.frame':	107 obs. of  10 variables:
 $ EMPLOYEE_ID  : int  100 101 102 103 104 105 106 107 108 109 ...
 $ FIRST_NAME   : Factor w/ 91 levels "Adam","Alana",..: 80 64 51 4 11 18 88 20 61 16 ...
 $ LAST_NAME    : Factor w/ 102 levels "Abel","Ande",..: 50 51 20 44 24 4 74 57 38 27 ...
 $ EMAIL        : Factor w/ 107 levels "ABANDA","ABULL",..: 90 74 61 6 11 17 104 23 73 19 ...
 $ PHONE_NUMBER : Factor w/ 107 levels "011.44.1343.329268",..: 37 38 39 58 59 60 57 61 50 45 ...
 $ HIRE_DATE    : Factor w/ 98 levels "01-AUG-96","01-JUL-98",..: 53 67 37 6 66 86 12 18 50 46 ...
 $ JOB_ID       : Factor w/ 19 levels "AC_ACCOUNT","AC_MGR",..: 4 5 5 9 9 9 9 9 7 6 ...
 $ SALARY       : int  24000 17000 17000 9000 6000 4800 4800 4200 12000 9000 ...
 $ MANAGER_ID   : int  NA 100 100 102 103 103 103 103 101 108 ...
 $ DEPARTMENT_ID: int  90 90 90 60 60 60 60 60 100 100 ...

 [1] "EMPLOYEE_ID"   "FIRST_NAME"    "LAST_NAME"     "EMAIL"
 [5] "PHONE_NUMBER"  "HIRE_DATE"     "JOB_ID"        "SALARY"
 [9] "MANAGER_ID"    "DEPARTMENT_ID"

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 100         Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
3 102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
  SALARY MANAGER_ID DEPARTMENT_ID
1 24000   NA        90
2 17000  100        90
3 17000  100        90

In [76]:
#select
head(select(empdata, FIRST_NAME, LAST_NAME, SALARY))
head(select(empdata, FIRST_NAME:SALARY))
head(select(empdata, -(EMAIL:SALARY)))

  FIRST_NAME LAST_NAME SALARY
1 Steven     King      24000
2 Neena      Kochhar   17000
3 Lex        De Haan   17000
4 Alexander  Hunold     9000
5 Bruce      Ernst      6000
6 David      Austin     4800

  FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID  SALARY
1 Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES 24000
2 Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP   17000
3 Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP   17000
4 Alexander  Hunold    AHUNOLD  590.423.4567 03-JAN-90 IT_PROG  9000
5 Bruce      Ernst     BERNST   590.423.4568 21-MAY-91 IT_PROG  6000
6 David      Austin    DAUSTIN  590.423.4569 25-JUN-97 IT_PROG  4800

  EMPLOYEE_ID FIRST_NAME LAST_NAME MANAGER_ID DEPARTMENT_ID
1 100         Steven     King       NA        90
2 101         Neena      Kochhar   100        90
3 102         Lex        De Haan   100        90
4 103         Alexander  Hunold    102        60
5 104         Bruce      Ernst     103        60
6 105         David      Austin    103        60

In [77]:
#filter
head(filter(empdata, SALARY>15000))
head(filter(empdata, SALARY>15000 & JOB_ID == "AD_VP"))
filter(select(empdata, FIRST_NAME, LAST_NAME, SALARY), SALARY>15000)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 100         Steven     King      SKING    515.123.4567 17-JUN-87 AD_PRES
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
3 102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
  SALARY MANAGER_ID DEPARTMENT_ID
1 24000   NA        90
2 17000  100        90
3 17000  100        90

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 101         Neena      Kochhar   NKOCHHAR 515.123.4568 21-SEP-89 AD_VP
2 102         Lex        De Haan   LDEHAAN  515.123.4569 13-JAN-93 AD_VP
  SALARY MANAGER_ID DEPARTMENT_ID
1 17000  100        90
2 17000  100        90

  FIRST_NAME LAST_NAME SALARY
1 Steven     King      24000
2 Neena      Kochhar   17000
3 Lex        De Haan   17000

In [78]:
#arrange (or sort)
head(arrange(empdata,SALARY))
tail(arrange(empdata,SALARY))
head(arrange(empdata,desc(SALARY)))

  EMPLOYEE_ID FIRST_NAME LAST_NAME  EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 132         TJ         Olson      TJOLSON  650.124.8234 10-APR-99 ST_CLERK
2 128         Steven     Markle     SMARKLE  650.124.1434 08-MAR-00 ST_CLERK
3 136         Hazel      Philtanker HPHILTAN 650.127.1634 06-FEB-00 ST_CLERK
4 127         James      Landry     JLANDRY  650.124.1334 14-JAN-99 ST_CLERK
5 135         Ki         Gee        KGEE     650.127.1734 12-DEC-99 ST_CLERK
6 119         Karen      Colmenares KCOLMENA 515.127.4566 10-AUG-99 PU_CLERK
  SALARY MANAGER_ID DEPARTMENT_ID
1 2100   121        50
2 2200   120        50
3 2200   122        50
4 2400   120        50
5 2400   122        50
6 2500   114        30

    EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER       HIRE_DATE
102 201         Michael    Hartstein MHARTSTE 515.123.5555       17-FEB-96
103 146         Karen      Partners  KPARTNER 011.44.1344.467268 05-JAN-97
104 145         John       Russell   JRUSSEL  011.44.1344.429268 01-OCT-96
105 101         Neena      Kochhar   NKOCHHAR 515.123.4568       21-SEP-89
106 102         Lex        De Haan   LDEHAAN  515.123.4569       13-JAN-93
107 100         Steven     King      SKING    515.123.4567       17-JUN-87
    JOB_ID  SALARY MANAGER_ID DEPARTMENT_ID
102 MK_MAN  13000  100        20
103 SA_MAN  13500  100        80
104 SA_MAN  14000  100        80
105 AD_VP   17000  100        90
106 AD_VP   17000  100        90
107 AD_PRES 24000   NA        90

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER       HIRE_DATE
1 100         Steven     King      SKING    515.123.4567       17-JUN-87
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568       21-SEP-89
3 102         Lex        De Haan   LDEHAAN  515.123.4569       13-JAN-93
4 145         John       Russell   JRUSSEL  011.44.1344.429268 01-OCT-96
5 146         Karen      Partners  KPARTNER 011.44.1344.467268 05-JAN-97
6 201         Michael    Hartstein MHARTSTE 515.123.5555       17-FEB-96
  JOB_ID  SALARY MANAGER_ID DEPARTMENT_ID
1 AD_PRES 24000   NA        90
2 AD_VP   17000  100        90
3 AD_VP   17000  100        90
4 SA_MAN  14000  100        80
5 SA_MAN  13500  100        80
6 MK_MAN  13000  100        20

In [95]:
# rename column names
empdata <- rename(empdata, EMP_ID=EMPID, F_N = FN, L_N = LN)
head(empdata)

  EMP_ID F_N       L_N     EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID  SALARY
1 100    Steven    King    SKING    515.123.4567 17-JUN-87 AD_PRES 24000
2 101    Neena     Kochhar NKOCHHAR 515.123.4568 21-SEP-89 AD_VP   17000
3 102    Lex       De Haan LDEHAAN  515.123.4569 13-JAN-93 AD_VP   17000
4 103    Alexander Hunold  AHUNOLD  590.423.4567 03-JAN-90 IT_PROG  9000
5 104    Bruce     Ernst   BERNST   590.423.4568 21-MAY-91 IT_PROG  6000
6 105    David     Austin  DAUSTIN  590.423.4569 25-JUN-97 IT_PROG  4800
  MANAGER_ID DEPARTMENT_ID z_salary
1  NA        90             4.4862310
2 100        90             2.6956592
3 100        90             2.6956592
4 102        60             0.6492915
5 103        60            -0.1180965
6 103        60            -0.4250516

In [93]:
# mutate - transform existing variable or create new vriable
empdata <- mutate(empdata, z_salary = ((SALARY - mean(SALARY))/sd(SALARY)))
head(select(empdata, SALARY, z_salary))
tail(select(empdata,SALARY, z_salary))

  SALARY z_salary
1 24000   4.4862310
2 17000   2.6956592
3 17000   2.6956592
4  9000   0.6492915
5  6000  -0.1180965
6  4800  -0.4250516

    SALARY z_salary
102 13000   1.672475327
103  6000  -0.118096457
104  6500   0.009801528
105 10000   0.905087420
106 12000   1.416679358
107  8300   0.470234272

In [84]:
# group_by

In [86]:
job_group <- group_by(empdata, JOB_ID)
summarize(job_group, sal = mean(SALARY), nos = length(SALARY))

   JOB_ID     sal   nos
1  AC_ACCOUNT  8300  1
2  AC_MGR     12000  1
3  AD_ASST     4400  1
4  AD_PRES    24000  1
5  AD_VP      17000  2
6  FI_ACCOUNT  7920  5
7  FI_MGR     12000  1
8  HR_REP      6500  1
9  IT_PROG     5760  5
10 MK_MAN     13000  1
11 MK_REP      6000  1
12 PR_REP     10000  1
13 PU_CLERK    2780  5
14 PU_MAN     11000  1
15 SA_MAN     12200  5
16 SA_REP      8350 30
17 SH_CLERK    3215 20
18 ST_CLERK    2785 20
19 ST_MAN      7280  5